# На вход программе подается два натуральных числа aa и bb (a < ba< b).
# Напишите программу, которая находит натуральное число из отрезка [a;b] с максимальной суммой делителей.
# a, b = int(input()), int(input())
# num, max = 0, 0
# for i in range(b, a, -1):
#    sum = 0
#    for j in range(1, i+1):
#        if i % j == 0:
#            sum += j
#    if sum > max:
#        max = sum
#        num = i
#
# print(num, max)



