# Дано натуральное число nn. Напишите программу, которая выводит значение суммы 1!+2!+3!+…+n!.
# Формат входных данных
# На вход программе подается одно натуральное число.
# Формат выходных данных
# Программа должна вывести значение суммы 1!+2!+3!+…+n!

# n = int(input())
# f = 1
# s = 0
# for i in range(1, n+1):
#     f *= i
#     s += f
# print(s)


#3 = 3*2*1
#1 = 1
#2 = 2*1
#3 = 3*2*1
# 1+ 2 + 6 = 9