# Дано натуральное число nn. Напишите программу, которая печатает численный треугольник с высотой равной nn, в соответствии с примером:
# 1
# 121
# 12321
# 1234321
# 123454321

# n = int(input())
# for i in range(n):
#     for j in range(1, i + 1):
#         print(j, end=' ')
#     for k in range(i+1, 0, -1):
#         print(k, end=' ')
#     print()
