# На вход программе подается одно число n.
# Напишите программу, которая выводит список,
# состоящий из nn букв английского алфавита ['a', 'b', 'c', ...] в нижнем регистре.

# n = int(input())
# print(list([chr(i) for i in range(97, 97+n)] ))
