# На вход программе подается строка текста, содержащая различные натуральные числа. Из данной строки формируется список чисел.
# Напишите программу, которая меняет местами минимальный и максимальный элемент этого списка.
# s = input().split()
# s = [int(i) for i in s]
# minn = min(s)
# maxx = max(s)
# for i in range(len(s)):
#     if s[i] == maxx:
#         s[i] = minn
#     elif s[i] == minn:
#         s[i] = maxx
# print(*s, end = ' ' )

# 2
# x = l.index(min(l))
# y = l.index(max(l))
# l[x], l[y] = max(l), min(l)
# print(l)
